from django.test import TestCase

# отправляем письмо
            # send_mail(
            #         subject=f'Новая подписка {category.category_name}',
            #         message=f'Вы подписались на рассылку в категории {category.category_name}!'
            #                 f'\nВы будете получать уведомление на почту, каждый раз когда прявится новость'
            #                 f'по выбранной теме.',  # сообщение с кратким описанием проблемы
            #         from_email='igor.vigol@yandex.ru',
            #         # здесь указываете почту, с которой будете отправлять (об этом попозже)
            #         recipient_list=['dzu960128@gmail.com']
            #         # здесь список получателей. Например, секретарь, сам врач и т. д.
            #     )

            # получаем наш html

